1s/ERP/Conf/Documents/Лико_ИзменениеПараметровПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ИзменениеПараметровПроизводства</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкоростьПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияДокументаИзменениеПараметровПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ПараметрыПроизводстваЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ПараметрыПроизводстваЗаказа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетрыНаНастройку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетрыНаБрак</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаНастройку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаСменуРоликов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкоростьПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетражДляРЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доходность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьПечатиНФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКликов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рентабельность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тираж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетражКвМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыНаОснастку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНаБрак</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлинаРолика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаНастройкуСерии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетрыНаНастройкуСерии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штампы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:CatalogRef.Лико_Спецификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВарианта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияДокументаИзменениеПараметровПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияДокументаИзменениеПараметровПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ИзменениеПараметровПроизводства/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_УтверждениеИзмененияПараметровПроизводства") Тогда
		Элементы.ДатаУтверждения.Доступность = Истина;
		Элементы.Состояние.Доступность = Истина;       
		Элементы.Подтвердить.Доступность = Истина;
		Элементы.Отклонить.Доступность = Истина;
	ИначеЕсли ЗначениеЗаполнено(Объект.Состояние) Тогда
		// Если состояние уже заполнено, то редактировать данные поля уже нельзя
		Элементы.Номер.ТолькоПросмотр = Истина;
		Элементы.Дата.ТолькоПросмотр = Истина;
		Элементы.ЗаказКлиента.ТолькоПросмотр = Истина;
		Элементы.НомерПроката.ТолькоПросмотр = Истина;
		Элементы.СкоростьПечати.ТолькоПросмотр = Истина;
		Элементы.РабочийЦентр.ТолькоПросмотр = Истина;
		Элементы.Автор.ТолькоПросмотр = Истина;
		Элементы.ВидСекции.ТолькоПросмотр = Истина;
		Элементы.Материал.ТолькоПросмотр = Истина;
		Элементы.Ответственный.ТолькоПросмотр = Истина; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
    КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеЗаказа()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЗаказКлиента");
	//ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаказКлиента");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Объект.ЗаказКлиента.НомерБезПрефикса);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьНормативнуюСкоростьПечати();
КонецПроцедуры

&НаКлиенте
Процедура НомерПрокатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) И ЗначениеЗаполнено(Объект.НомерПроката) Тогда
		РабочийЦентрПредыдущий = Объект.РабочийЦентр;
		РабочийЦентрНовый = НайтиРЦЗаказа(Объект.ЗаказКлиента, Объект.НомерПроката);
		Если ЗначениеЗаполнено(РабочийЦентрНовый) И РабочийЦентрПредыдущий <> РабочийЦентрНовый Тогда
			Объект.РабочийЦентр = РабочийЦентрНовый;
			Если ЗначениеЗаполнено(РабочийЦентрПредыдущий) Тогда
				Сообщить("Рабочий центр изменен (был """ + РабочийЦентрПредыдущий + """, стал """ + Объект.РабочийЦентр + """)");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьНормативнуюСкоростьПечати();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиРЦЗаказа(Заказ, НомерПроката)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиентаЦвета.РабочийЦентр КАК РабочийЦентр
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &Ссылка
		|	И ЗаказКлиентаЦвета.НомерПроката = &НомерПроката
		|	И ЗаказКлиентаЦвета.РабочийЦентр <> ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиентаЦвета.НомерСтроки";
	
	Запрос.УстановитьПараметр("НомерПроката", НомерПроката);
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РабочийЦентр) Тогда
		Возврат ВыборкаДетальныеЗаписи.РабочийЦентр;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Подтверждено") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаУтверждения) Тогда
			Объект.ДатаУтверждения = ТекущаяДата();
		КонецЕсли;
	Иначе
		Объект.ДатаУтверждения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НеобходимоПерепровестиЗаказ") Тогда
		Лико_Дополнительно.ЗапуститьПерепроведениеЗаказаВФоне(ТекущийОбъект.ЗаказКлиента);
		Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ПредыдущийЗаказ")
			И ЗначениеЗаполнено(ТекущийОбъект.ДополнительныеСвойства.ПредыдущийЗаказ)
			И ТекущийОбъект.ДополнительныеСвойства.ПредыдущийЗаказ <> ТекущийОбъект.ЗаказКлиента Тогда 
			// Запустим перепроведение предыдущего заказа
			Лико_Дополнительно.ЗапуститьПерепроведениеЗаказаВФоне(ТекущийОбъект.ДополнительныеСвойства.ПредыдущийЗаказ);
		КонецЕсли;
	КонецЕсли;
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("НужноОтправитьПисьмо") Тогда
		ОтправитьПисьмо();	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОтправитьПисьмо()

	Тема = "Создан документ ""Изменение параметров производства""";
	НавигационнаяСсылка = Лико_Дополнительно.СформироватьНавигационнуюСсылкуОбъекта(Объект.Ссылка);
	НомерГиперссылка = "<a href=""" + НавигационнаяСсылка + """>" + Объект.Номер + "</a>";
	Текст = Тема + " N " + НомерГиперссылка + ". Требуется подтверждение";
	Адресат = "OlegPak@okil.ru;NASmirnova@okil.ru";
	Лико_Планирование.ОтправитьПисьмо(Текст, Тема, Адресат,,,,,, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Состояние <> ТекущийОбъект.Ссылка.Состояние
		ИЛИ ?(ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение, Истина, Ложь) <> ТекущийОбъект.Ссылка.Проведен
		ИЛИ 
		(ТекущийОбъект.Ссылка.Состояние = Перечисления.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Подтверждено  // В утвержденном документе поменяли ключевые параметры
			И (ТекущийОбъект.СкоростьПечати <> ТекущийОбъект.Ссылка.СкоростьПечати
				ИЛИ ТекущийОбъект.ЗаказКлиента <> ТекущийОбъект.Ссылка.ЗаказКлиента
				ИЛИ ТекущийОбъект.НомерПроката <> ТекущийОбъект.Ссылка.НомерПроката
				ИЛИ ТекущийОбъект.Дата <> ТекущийОбъект.Ссылка.Дата
			)
		)
		Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НеобходимоПерепровестиЗаказ"); 
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ПредыдущийЗаказ", ТекущийОбъект.Ссылка.ЗаказКлиента); 
	КонецЕсли; 
	
	Если НЕ ТекущийОбъект.Ссылка.Проведен И ?(ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение, Истина, Ложь)
		И НЕ ЗначениеЗаполнено(ТекущийОбъект.Состояние)
		И ТекущийОбъект.ЗаказКлиента.Площадка = Справочники.Лико_Площадки.Ликофлекс
		Тогда
		// Нужно отправить письмо Паку
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НужноОтправитьПисьмо");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОтклонить(Команда)
	
	Если Команда.Имя = "Подтвердить" Тогда
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Подтверждено");
	ИначеЕсли Команда.Имя = "Отклонить" Тогда
		Объект.Состояние = ПредопределенноеЗначение("Перечисление.Лико_СостоянияДокументаИзменениеПараметровПроизводства.Отклонено");
	Иначе
		Сообщить("Ошибка. Обратитесь к программистам");
		Возврат;
	КонецЕсли;
	СостояниеПриИзменении(Неопределено);
	Если Записать(Новый Структура("РежимЗаписи,РежимПроведения", РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный)) Тогда
		Закрыть();
	Иначе
		Сообщить("Ошибка при записи документа. Попробуйте еще раз");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормативнуюСкоростьПечати()

	НормативнаяСкоростьПечати = 0;
	Элементы.НормативнаяСкоростьПечати.Ширина = 4;
	Если НЕ ЗначениеЗаполнено(Объект.ЗаказКлиента) ИЛИ НЕ ЗначениеЗаполнено(Объект.НомерПроката) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_ПараметрыПроизводстваЗаказа.СкоростьПечати КАК СкоростьПечати
		|ИЗ
		|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
		|ГДЕ
		|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
		|	И Лико_ПараметрыПроизводстваЗаказа.НомерПроката = &НомерПроката
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкоростьПечати";
	
	Запрос.УстановитьПараметр("Заказ", Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("НомерПроката", Объект.НомерПроката);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НормативнаяСкоростьПечати = ВыборкаДетальныеЗаписи.СкоростьПечати;
	КонецЕсли;
	
	ДлинаСкорости = СтрДлина(Формат(НормативнаяСкоростьПечати, Элементы.НормативнаяСкоростьПечати.Формат));
	Если ДлинаСкорости > 5 Тогда
		Элементы.НормативнаяСкоростьПечати.Ширина = ДлинаСкорости - 1;
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ЗаполнитьНормативнуюСкоростьПечати();
КонецПроцедуры
